"use client";
import PrimaryBtn from "@/components/ui/button/PrimaryBtn";
import DarkShade from "@/components/ui/greenShade/DarkShade";
import { ChevronDownIcon } from "@heroicons/react/24/outline";
import { DocumentTextIcon } from "@heroicons/react/24/solid";
import { useState } from "react";
import TitleHeader from "./TitleHeader";



function CourseDesc() {
  const [expand, setExpand] = useState(false);
  return (
    <>
    <div className="bg-white dark:bg-darker rounded-2xl p-4.5 sm:p-5 mt-8">
    <TitleHeader title="توضیحات" Icon={DocumentTextIcon} className="bg-amber-400" IconColor="text-amber-400"/>
      {/* desc */}
      <div className="relative overflow-hidden">
        <div className={`${expand ? "h-auto max-h-[800px] overflow-y-auto" : "h-[400px]"}`}>
          <p>
            NEXT.Js یا NEXT طی چندسال اخیر برای تکمیل و تقویت تکنولوژی React
            وارد میدون شد و سعی کرد تمام نواقص یا محدودیت های اون رو پوشش بده تا
            هیچ شک و شبهه ای در قدرت ری اکت برای طراحی صفحات وب باقی نمونه. به
            عبارتی اومده تا با ویژگی فول استک بودن، React رو فراتر از یک
            تکنولوژی فرانت اند جا بندازه و از طریق ترکیب اون با Node Js در بک
            اند، به شما کمک کنه یک پروژه کامل و صفر تا صد وب رو به بهترین شکل
            طراحی و پیاده سازی کنید.
          </p>
          <p className="">
            اگر در برنامه نویسی دنبال کاهش کدهای برنامه، سرعت اجرای فوق العاده
            وب سایت، فول استک بودن تکنولوژی و همینطور پشتیبانی اون هستید، NEXT
            یکی از بهترین گزینه های موجود روی میز شما خواهد بود چون علاوه بر
            داشتن تمام مزایای ری اکت، اکثر ایراداتی که توسعه دهنده های تکنولوژی
            های رقیب به اون وارد میکردن رو پوشش داده و حتی فراتر از اونها عمل
            کرده. در ادامه به طور خلاصه ویژگی های اصلی که باعث افزایش قدرت و
            محبوبیت NEXT در بین توسعه دهنده ها شده رو باهم بررسی خواهیم کرد. با
            ما همراه باشید… رندرینگ سمت سرور (SSR) در واقع NEXT امکان بارگذاری
            صفحات React در سمت سرور رو به شما میده که این کار باعث میشه بتونید
            صفحات رو ابتدا با اطلاعات و داده های سرور پر کرده و بعد از داینامیک
            شدن، اون رو به عنوان یک صفحه HTML آماده به کاربران نمایش بدید.
            پشتیبانی از CSR (Client-Side Rendering) NEXT علاوه بر اینکه قابلیت
            رندرینگ سمت سرور رو در اختیار شما میذاره، در عین حال امکان رندرینگ و
            بارگذاری محتوا سمت کلاینت رو هم برای شما فراهم میکنه. پس با استفاده
            از این قابلیت میتونید بدون بارگذاری یا رفرش مجدد صفحات، به صورت لحظه
            ای تغییرات کاربری رو اعمال کرده و نمایش بدید. Routing ساده و
            اتوماتیک در NEXT یک سیستم Routing ساده و قابل فهم وجود داره که صفحات
            جدید رو با استفاده از فایل های جدیدی که میسازید و پوشه بندی که خودش
            انجام میده، به صورت اتوماتیک مسیریابی میکنه که یکی از ویژگی های مهم
            این تکنولوژی محسوب میشه. در حالی که این کار در React باید به صورت
            دستی انجام میشد. پشتیبانی از Static Site Generation (SSG) این قابلیت
            فوق العاده به شما کمک میکنه تا برای کاهش بار سرور و حجم درخواست های
            ارسالی به سمت اون، بخشی از قسمت ها و صفحات رو به صورت استاتیک طراحی
            کنید تا برای هربار لود شدن نیازی به ارسال درخواست وجود نداشته باشه.
            این مزایا در کنار دهها ویژگی دیگه باعث بهبود تجربه کاربری و سرعت
            سایت میشه که نتیجه اون تسهیل و تقویت فرآیند سئو خواهد بود. اساسا یکی
            از مهمترین دلایل معرفی NEXT پوشش نقاط ضعف React در مباحث سئو بود که
            دیگه میشه گفت کاملا برطرف شده و از لحاظ گوگل پسند بودن جزو
            بهترینهاست. حالا که با ویژگی های فنی NEXT آشنا شدید، در ادامه به
            تمام سوالات و دغدغه هایی که ممکنه قبل از شروع دوره در ذهن شما باشه
            جواب دادیم تا با خیال راحت و دید باز مسیر آموزشتون رو شروع کنید. تو
            این دوره قراره چی یاد بگیریم؟ به طور خلاصه در این دوره شما هر آنچه
            برای مسلط شدن به NEXTJS نیاز داشته باشید به شما آموزش داده میشه.
            یعنی ابتدا یه سری نکات کلی در مورد سئو در فرانت اند به شما آموزش
            داده میشه که توصیه میکنیم حتما این قسمت‌های اول رو که رایگان هم هستن
            ببینید تا علاوه بر اصلاح و تکمیل تسلط شما به این موضوع، آمادگی خوبی
            برای مطالب بعدی پیدا کنید. در مرحله بعد کانسپت های اصلی و اساسی
            NEXTJS رو به صورت کامل و عمیق آموزش می بینید به صورتی که بتونید در
            پروژه های واقعی و کاربردی ازشون استفاده کنید. در واقع در این مرحله
            هست که به صورت عمیق با NEXTJS و قدرت اون آشنا خواهید شد. بعد از
            اینکه تونستید با کانسپت های اصلی NEXTJS آشنا بشید، وارد مرحله جذاب
            پروژه های عملی میشید و اونجا با چهار تا مینی پروژه مطالب رو مرور
            خواهید کرد. بعد از اون یک پروژه خیلی خوب توسعه میدید تا مطمئن بشیم
            به تسلط کامل رسیدید. این دوره برای چه کسانی مناسب هست؟ دوره جامع
            NEXT برای دو دسته از دانشجوها خیلی مفید و کاربردی هست. دسته اول
            کسانی که در حال حاضر در سطح متوسط و پیشرفته با React کار میکنن دسته
            دوم کسانی که قبلا دوره NEXT در جاهای دیگه رو گذروندن اما به هر دلیل
            خوب مسلط نشدن یا نتونستن از مطالب اون دوره استفاده کنن اگر جزو یکی
            از این دوتا دسته هستید، این دوره جامع برای شما تولید شده و اونقدر به
            دانش و تجربیات شما اضافه می‌کنه که هر ایده و طرحی تو ذهنتون بیاد رو
            به راحتی بتونید پیاده سازی کنید یا حتی بخش هایی از پروژه های دیگران
            رو که از نظر شما جذاب و خلاقانه هستن، در پروژه خودتون بسازید. چرا
            سبزلرن بهترین گزینه برای یادگیری هست ؟ ما با سیاست خاصی که در انتخاب
            استاد، تدوین محتوای آموزشی، قیمت گذاری دوره ها و پشتیبانی موثر در
            نظر گرفتیم میتونیم این تضمین رو به شما بدیم که در طول دوره آموزش،
            هیچ کمبودی در هیچ زمینه ای احساس نکنید. بیاید چند مورد از ویژگی های
            مهم دوره آموزش NEXT سبزلرن رو باهم بررسی کنیم. پشتیبانی رایگان و
            مادام‌العمر دوره جامع NEXT سبزلرن پشتیبانی رایگان و مادام‌العمر
            داره. یعنی شما حتی بعد از استخدام می‌تونید سوالات و ابهاماتی که
            دارین رو توسط پشتیبانی دوره برطرف کنین. برای اطمینان از این موضوع
            حتما یه سر به کامنت ها بزنید. پروژه محور بودن دوره در دوره جامع NEXT
            سبزلرن علاوه بر 4 مینی پروژه، استاد سعیدی راد یک پروژه فروشگاهی
            پیشرفته به عنوان پروژه نهایی رو به صورت فول‌استک با بک اند اختصاصی،
            جلوی چشم شما و قدم به قدم توسعه میده تا تمام نکات ریز و درشت این
            تکنولوژی رو در عمل یاد بگیرید. جالبه بدونید پروژه نهایی دوره دقیقا
            طبق اصول جاری در شرکت های واقعی توسعه داده شده تا بتونید با چالش های
            واقعی بازار کار هم آشنا شده و بعد از گذروندن دوره با آمادگی بالا
            وارد بازار کار این تخصص بشید. منتورشیپ بودن دوره پشتیبانی دوره در
            گروه تلگرامی انجام میشه و علاوه بر مدرس، چند نفر کمک پشتیبان مسلط هم
            جهت پاسخگویی و رفع مشکلات شما حضور دارن. بنابراین برای دریافت
            راهنمایی و جواب سوالات، درگیر تیکت و انتظار نمیشید و در سریع ترین
            زمان ممکن کارتون راه میفته! خلاصه اینکه صدها برنامه نویس فوق حرفه ای
            که در دانشگاه سبزلرن پرورش پیدا کردن الان تو شرکت های بزرگ مشغول
            هستن و نتیجه انتخاب درست منبع آموزشی و تمرینات منظم خودشون رو گرفتن.
            پس قطعا شما هم میتونید ردپای اونهارو دنبال کنید و به آرزوتون برسید.
            بعد از اتمام دوره به چه نتیجه ای می رسیم؟ بعد از سال ها تجربه و
            پرورش صدها برنامه نویس می تونیم به جرات اعلام کنیم که کامل ترین و
            بهترین دوره آموزش NEXT در اختیار شماست و غیر از اون به هیچ منبع و
            استاد دیگه ای نیاز نخواهید داشت. با بهترین کیفیت، بهترین مدرس و
            بهترین پشتیبانی! دوره ای که صدها دانشجو داشته و میزان رضایت اون هارو
            میتونید در قسمت کامنت های صفحه محصول ببینید. باعث افتخار هست که
            تونستیم تا این حد نظرات مثبت دانشجویان با شرایط تخصصی و سنی مختلف رو
            به دست بیاریم. حتما می دونید که محبوبیت سبزلرن به خاطر جامع بودن و
            عمیق بودن دوره های اون هست و حتی یک دوره عادی و معمولی در سبزلرن
            پیدا نمی کنید. دوره آموزش NEXT هم از این قاعده مستثنی نیست. شما بعد
            از دیدن این دوره و مسلط شدن به مباحث هم میتونید در سطح حرفه ای
            فریلنسری پروژه بگیرید و هم با داشتن امتیاز تسلط به NEXT در اولویت
            استخدام شرکت ها قرار بگیرید چون به شدت تقاضای اون در بازار کار زیاد
            هست. ” البته طبیعیه اول کار ذهنتون مقاومت کنه چون تا الان سبزلرنی
            آموزش ندیدید اما بعد از پایان آموزش خودتون این حس رو پیدا خواهید
            کرد. البته با کمک و همراهی خود شما! ” این دوره پیش نیاز خاصی داره که
            باید قبلش بلد باشم؟ تسلط خیلی خوب روی ری اکت مهم ترین پیش نیاز این
            دوره حساب میشه. همچنین از اونجایی که برای یادگیری ری اکت هم باید
            کاملا به HTML CSS و همینطور جاوا اسکریپت مسلط باشید، پس انتظار میره
            که این موارد رو هم در سطح قابل قبولی کار کرده و چند پروژه خوب با
            اونها توسعه داده باشید تا بتونید حداکثر بهره برداری رو از دوره NEXT
            تجربه کنید. اگه از دانشجوهای قدیمی سبزلرن باشید که میدونید اما اگه
            جدیدا افتخار میزبانی از شمارو پیدا کردیم، بدونید که هم دوره HTML و
            هم CSS و هم جاوا اسکریپت در سبزلرن رایگان هستن و در واقع مهمون ما
            هستید برای شروع یک مسیر هیجان‌انگیز در زندگی حرفه ای خودتون. این هم
            از دغدغه پیش نیازها! چطور میتونم پروژه دانشجویان قبلیتون رو ببینم ؟
            مدرس هر دوره معمولا صفحه خودش رو در شبکه اجتماعی با شما به اشتراک
            میگذاره. شما میتونید با دنبال کردن اون با کلی دانشجو و پروژه ای که
            توسط اونها انجام شده آشنا بشید تا ادعای سبزلرن در مورد کیفیت آموزش
            ها از جمله آموزش NEXT به شما اثبات بشه. کسانی که مثل خودتون روز اولی
            داشتن و کلی تردید و نگرانی تو ذهنشون بود اما الان و با ادامه مسیر
            یادگیریشون در بقیه حوزه ها، به برنامه نویس های حرفه ای تبدیل شدن که
            هر شرکتی آرزوی همکاری با اون‌هارو داره . چون از دانشگاه شریف برنامه
            نویسی یعنی سبزلرن فارغ التحصیل شدن. وقتی این دوره رو دیدم قدم بعدیم
            چیه؟ برای شروع قدم بعدی با مشورت گرفتن از طریق پشتیبانی دوره و به
            اشتراک گذاشتن جزئیاتی از سطح علمی و تجربی، شرایطی شخصی و شغلی
            خودتون، میتونید بهترین قدم رو برای شروع یادگیری انتخاب کنید و پیش
            برید. اما به طور کلی حتما بعد از پایان دوره و توسعه پروژه ها، نمونه
            کارهای خودتون رو از طریق بخش پشتیبانی برای مدرس دوره ارسال کنید تا
            از لحاظ فنی بررسی بشه و نظر و راهنمایی دقیقی از ایشون دریافت کنید که
            میتونه کلی از آزمون و خطاهای آینده شمارو کم کنه. توصیه سبزلرن اینه
            که وقتی یک دوره کامل رو می گذرونید، دیگه وقت تمرین کردن و پروژه
            ساختن هست. حتی میتونید پروژه هایی که تو ذهنتون هست یا دیگران ساختن
            رو بنویسید تا کاملا مطمئن بشید به حد کافی از تسلط رسیدید و یه رزومه
            قابل قبول تدوین کنید. بلافاصله بعد از این روزها می تونید با اعتماد
            به نفس کامل وارد بازار کار بشید و از این آموزش‌ها پول های درشت
            بسازید که اون موقع هزینه دوره در مقابل اونها کاهی به کوهه! چه تضمینی
            هست که خوب و کامل یاد بگیرم؟ چندین دلیل هست که معمولا باعث نتیجه
            گیری عالی شما از دوره آموزش NEXT میشه : کیفیت محتوای آموزشی و مدرس
            دوره اشتیاق و علاقه مندی بالا برای یادگیری پشتیبانی در دسترس و قوی
            در حین آموزش مرور و تمرین مطالب و انبار نکردن اونها برای روز مبادا !
            تسلط نسبی به زبان انگلیسی، جاوا اسکریپت و React مطالعه منظم و کامل
            مستندات رسمی NEXT (داکیومنت) چهار مورد اینها بر عهده شماست و دو مورد
            هم بر عهده سبزلرن. ما به شما قول میدیم این آموزش رو با بالاترین
            کیفیت و موثرترین پشتیبانی در اختیار شما قرار بدیم. شما قول میدید که
            با علاقه و پشتکار تمام تمرینات رو انجام بدید تا به نتیجه برسید؟! پس
            همه چی حله… این تخصص از لحاظ درآمدی چطوره ؟ وقتی یک زبان برنامه
            نویسی یا فریم ورک خاصی روند توسعه خیلی خوبی می گیره، به دنبالش
            کاربرد و رواج اون هم در کشورها بیشتر میشه. بعدش چه اتفاقی میفته؟!
            تقاضای متخصص اون زبان در بازار زیاد میشه. بعدش ؟ چون میزان تقاضا
            نسبت به افراد متخصص این حوزه خیلی بیشتر هست، پس حقوق ها هم در سطح
            بالایی تعیین میشه. به عنوان مثال برنامه نویس React و NEXT بسته به
            بزرگی شهر محل سکونت یا پروژه بین 30 تا 60 میلیون تومن ماهانه دریافت
            می کنه که 4 تا 8 برابر یک حقوق عادی اداره کار درنظر گرفته شده. هرچند
            معمولا حقوق و دستمزد متخصص NEXT بیشتر از React هست چون تکنولوژی مدرن
            تری محسوب میشه و آینده جاوا اسکریپت رو در زمینه برنامه نویسی وب رقم
            میزنه. پس بدونید که آینده این تخصص از لحاظ درآمدی هم فوق العادست به
            شرطی که به مهارت بالایی برسید. مدرس این دوره چه کسی هست و چه مزیتی
            نسبت به دیگران داره؟ مدرس این دوره استاد سعیدی راد هست که با تجربه
            بالا و سابقه طولانی که در زمینه برنامه نویسی (به خصوص جاوا
            ‌‌اسکریپت) داره، مطالب رو به ساده ترین شکل ممکن بیان می کنه طوری که
            خودتون هم نخواید یاد بگیرید، آخرش یاد می‌گیرید. ایشون انتخاب شده چون
            اعتقاد داریم مدرسی که اطلاعاتش به روز هست و مستقیما با بازار کار
            جاوا اسکریپت و کل تکنولوژی های زیرشاخه اون سروکار داره، سبکش با مدرس
            عادی و تئوری محور متفاوته. (مثل اکثر اساتیدی که در دانشگاه داشتیم!)
            یکی از خصلت های ویژه ایشون اهمیت به پشتیبانی فنی دانشجوهاست و تا حد
            امکان به صورت مستقیم مشکلات و سوالات اون هارو در پلتفرم های مختلف
            جواب میده. آقای سعیدی راد هم مثل بقیه اساتید سبزلرن یه راست وارد اصل
            مطلب میشه و شاخ و برگ اضافی و خسته کننده در آموزش های ایشون نمی
            بینید و این یعنی بهترین آموزش NEXT رو در کنار ایشون تجربه می کنید.
            اگر هم قبلا دوره جامع آموزش جاوا اسکریپت رو با ایشون گذرونده باشید
            پس قطعا با کیفیت و سبک جذاب تدریس اون آشنا هستید. مدت دوره کمه یا
            زیاد؟ آپدیت هم میشه؟ مدت دوره آموزش NEXT هم مثل بقیه دوره های
            سبزلرن، کاملا متناسب با موضوع و تنوع مطالب اون تعیین شده و با هر
            تغییری که در دنیای تکنولوژی و مطالب آموزشی اتفاق میفته، طبیعتا
            برنامه آموزشی سبزلرن هم متناسب با اون آپدیت میشه. بیشتر زمان این
            دوره مربوط به کدنویسی و پروژه های تمرینی هست. برای همینه که با
            قاطعیت میگیم این دوره صفر تا صد محسوب میشه. از طرف دیگه مدرسین هر
            دوره به دلیل آپدیت بودن با شرایط تکنولوژی و بازار کار، در اولین
            فرصتی که آپدیت یا اصلاح خاصی کشف کنن، حتما فایل های جدید رو به عنوان
            آپدیت در اختیار تیم پشتیبانی سبزلرن قرار میدن تا به پنل کاربری
            دانشجوها اضافه بشه. بنابراین خیالتون از بابت پویا بودن و به روز بودن
            مطالب دوره هم راحت راحت باشه! اگر با سوال یا مشکلی مواجه شدم،
            پشتیبانی می کنید؟ 100% رایگان، سریع، راحت! ما در سبزلرن اعتقاد داریم
            تا زمانی که دانشجو در عمل نتونسته یک پروژه رو صفر تا صد با محتوای
            دوره پیاده سازی کنه، پس هنوز یادگیریش تموم نشده و تا رسیدن به این
            مرحله، علاوه بر اساتید، تیم پشتیبانی هم در دسترس شما هست تا هر سوال
            یا ابهامی داشتید به شما کمک کنه. ما کاملا درک می کنیم ورود به دنیای
            برنامه نویسی بدون داشتن پشتیبان در دسترس به عنوان یک دوست قابل
            اعتماد، در یادگیری و رسیدن به نتیجه چقدر سخته. برای همین با تمام
            وجود در کنارتون هستیم تا به هر تخصصی که دوست دارید برسید. تمام
            قد!!!! یادگیری NEXT در ادامه مسیر شغلی و تخصصی چه کمکی به من می‌کنه؟
            گفتیم که جاوا اسکریپت یکی از زبان های پرکاربرد و رایج دنیای امروز
            هست که تخصص های مختلف داره. یعنی وقتی خود جاوا اسکریپت خام رو یاد
            گرفتید، بعد از اون با یادگیری استفاده از انواع کتابخانه ها و
            فریم‌ورک‌های مبتنی بر جاوا اسکریپت مثل React و بعد همین NEXT که جزو
            مدرن ترین تکنولوژی های این حوزه هستن، میتونید مستقیما وارد بازار کار
            شده و انواع پروژه های کوچک و بزرگ رو به بهترین شکل و کاملا استاندارد
            بنویسید. یادتون باشه با تکنولوژی هایی طرف هستید که در غول هایی مثل
            فیسبوک و اینستاگرام از اونها استفاده میشه … ” یاد گرفتن و تسلط به
            NEXT به معنی پادشاهی در حوزه برنامه نویسی وب و جاوا اسکریپت هست چون
            علاوه بر فول استک بودن، مزیت های فوق العاده ای در سرعت و انعطاف
            پذیری داره که کار روی برای رقبای دیگه سخت میکنه.” مطالب دوره واقعا
            صفر تا صد هست و نیاز به دوره و استاد دیگه ای نخواهیم داشت؟ اساسا یک
            دوره آموزشی خوب باید در حدی جامع و کامل باشه که دانشجو بین سایت ها و
            دوره های مختلف سردرگم نشه. سبزلرن هم با همکاری و همفکری اساتید،
            مطالب آموزشی رو طوری طراحی کرده که بعد از پایان اون دوره، نیاز خاصی
            به دوره‌های مشابه دیگه نخواهید داشت. برای اطمینان از کیفیت، ما به
            طور مستمر محتوای آموزشی رو با منابع و داکیومنت های رسمی و همینطور
            نیاز بازار کار تطبیق میدیم تا هم از لحاظ کامل بودن و هم ترتیب
            یادگیری در بهترین حالت ممکن باشه. برای همین هست که دوره‌های سبزلرن
            تقریبا تمام سرفصل های اصلی رو شامل میشه و دانشجوها هرچیزی که برای
            تبدیل شدن به یک برنامه‌نویس حرفه‌ای نیاز دارن رو آموزش می بینن. این
            دوره طوری طراحی شده که با صرف کمترین زمان به نتیجه مطلوب می رسید و
            pdf آموزش NEXT هم در اختیارتون قرار میگیره تا راحت تر بتونید هرجا و
            در هر زمانی به مطالعه‌ی اون بپردازید. برای یادگیری و تسلط کامل باید
            شبانه روزی تمرین کنم؟ تمرین شبانه روزی و بی وقفه ممکنه روزهای اول به
            خاطر انگیزه و اشتیاق باشه اما به مرور زمان و با آثار مخربی که به
            سلامتی جسمی و روحی شخص وارد میکنه، جای خودش رو به خستگی و بی حوصلگی
            میده. تعادل در همه چیز خوبه حتی تمرین! روزی چند ساعت باید وقت بگذارم
            تا خوب یاد بگیرم؟ این سوال در مورد هر درس و رشته ای غلط هست چون هر
            شخصی نسبت به آمادگی ذهنی، علاقه، پشتکار و زمانی که برای آموزش اختصاص
            میده، تعیین میکنه هر درسی رو در چه زمانی یاد بگیره. بنابراین نمیشه
            یک نسخه واحد برای همه پیچید اما یه قانون قطعی وجود داره. هرچقدر
            زمانی که میذارید با چاشنی تمرکز و اشتیاق همراه باشه، فاصله شما تا
            رسیدن به هدف نهایی هم کوتاه تر خواهد بود. حالا فرقی نمیکنه آموزش
            NEXT باشه یا کاراته یا آشپزی! به قول شاعر : رهرو آن نیست که گهی تند
            و گهی خسته رود رهرو آن است که آهسته و پیوسته رود… این دوره گارانتی
            هم داره؟! اولین تضمین، نظر دانشجویان قبلی هست که میتونید کاملا شفاف
            مطالعه کنید. دومین تضمین رایگان بودن بخش های اول اون هست که هیچ
            ریسکی برای شما ایجاد نمیکنه. بنابراین می تونید با خیال راحت و بدون
            دغدغه فقط روی آموزش دیدن تمرکز کنید و قبل از پرداخت هزینه، با سبک
            تدریس و کیفیت کلی دوره آشنا بشید. ما سال هاست که در زمینه آموزش
            برنامه نویسی، هزاران دانشجوی عزیز مثل شمارو تحویل جامعه نرم افزار و
            توسعه وب دادیم و همیشه سعی کردیم با رفع نواقص و خطاها، بهترین شرایط
            رو فراهم کنیم. با این وجود اگر به هر دلیلی از کیفیت آموزش ها راضی
            نبودید می تونید خیلی راحت به پشتیبانی تیکت بزنید و وجه پرداختی
            خودتون رو پس بگیرید. این حق شماست! هرچند همین که سبزلرن این امکان رو
            فراهم کرده تا موقتا کاربران بتونن بخش های اول دوره آموزش NEXT رو به
            صورت رایگان ببینن، خودش دلیلی بر حسن نیت و اعتماد ما به کیفیت دوره
            در مقابل بقیه آموزش های موجود هست. شرکت نکنم چه چیزی رو از دست میدم؟
            شما یا قصد دارید به صورت تخصصی وارد برنامه نویسی وب بشید یا نه! اگر
            چنین قصدی ندارید و صرفا برای تحقیق یا احیانا کنجکاوی دنبال آموزش
            هستید که جای خود! اما اگه قصد حرفه ای شدن و متخصص شدن در یکی از حوزه
            های برنامه نویسی به خصوص برنامه نویسی وب رو دارید، سهل انگاری در
            تکمیل آموزش تکنولوژی های تخصصی مثل NEXT به عنوان ترمز برای شما عمل
            میکنه و پیشرفتتون رو به تاخیر میندازه. ” چون دنیای تکنولوژی و برنامه
            نویسی خیلی سریع درحال پیشرفت و پوست اندازیه و اگه نتونید با این
            جریان خروشان همراه بشید قطعا نهایت موفقیت شما کارمندی عادی یا
            فریلنسری در پروژه های کوچیک و متوسط هست که سال به سال هم کمتر و کمتر
            خواهند شد. اما اگه متخصص به‌روزی باشید، مثل یه توپ شناور در استخر،
            هرچقدر هم تکنولوژی جدید بیاد و تنوع بیشتر بشه، شما اتوماتیک در
            بالاترین سطح باقی میمونید و حرف اول رو در بازار می زنید. ” در این
            دوره چه پروژه هایی تمرین می کنیم؟ پروژه ToDoList همراه با بک اند
            کاملی که باهم توسعه میدیم. Task management : یک مدیر گروه زمانی که
            چندتا کاربر یا کارمند داره میتونه برای هر کدوم از این کارمندان تسک
            یا ماموریت مشخص کنه. مینی پروژه pagination هم پروژه بعدی هست که به
            طور کامل توسعه داده میشه. یک پروژه املاکی کامل و فوق العاده که شامل
            صفحه اصلی، صفحه دسته بندی محصولات و صفحه جزئیات محصول میشه. پروژه
            نهایی و بزرگ دوره هم یک CMS فروشگاه قهوه هست که به صورت اختصاصی
            طراحی و توسعه خواهیم داد. کلام آخر توضیحات دوره انقدر جامع و شفاف
            بود که بعید می‌دونیم جای سوال و ابهامی برای شما باقی مونده باشه اما
            به طور خلاصه و برای یادآوری، به شما می‌گیم که این دوره با یک استاد
            حرفه ای و کاربلد، مطالب کامل و بیانی ساده ضبط شده که یادگیری اون
            میتونه راه شمارو برای ادامه مسیر برنامه نویسی وب هموارتر کنه. از
            اونجایی که NEXT یک غول تمام عیار و فول استک بر پایه جاوا اسکریپت و
            ری اکت هست، با ویژگی های فنی جذاب و سرعت و انعطاف‌پذیری فوق‌العاده
            ای که داره، به نوعی مکمل React برای پوشش دادن نقاط ضعف و همینطور
            مدیریت بخش بک‌اند اون محسوب میشه و به شدت مورد استفاده پروژه های
            بزرگ و کوچیک قرار گرفته. بنابراین واضحه که یادگیری اون میتونه سکوی
            پرتابی برای شما باشه تا خودتون رو با شرایط بازار کار وفق بدید و
            زندگی مالی فوق‌العاده ای رو تجربه کنید. تیم سبزلرن هم که همه چیز رو
            آماده کرده و همه مقدمات لازم رو از صفر تا استخدام برای شما تدارک
            دیده تا در یک محیط کاملا حرفه ای، پویا و تعاملی، به روزترین آموزش
            هارو دریافت کرده و به یک Web Developer واقعی و کامل تبدیل بشید. پس
            اصلا معطل نکنید و همین الان اولین جلسات رو بصورت رایگان شروع کنید…
            هرسوالی داشتید همینجا بپرسید تا مشاوران سبزلرن در کمترین زمان ممکن
            به شما جواب بدن
          </p>
        </div>
       {!expand && <DarkShade />}
      </div>
      <PrimaryBtn
      onClick={()=>setExpand(is=>!is)}
        type="button"
        size="xl"
        variant="fill"
        className="w-full px-8 gap-x-2 sm:w-auto mx-auto mt-5">
        <span>مشاهده {!expand ? "بیشتر":"کمتر"} مطلب</span>
        <ChevronDownIcon className={`size-6 ${expand&& "rotate-180"}`} />
      </PrimaryBtn>
    </div>
    </>

  );
}



export default CourseDesc;
